MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J94/mcu.h
extern volatile REFO1CON1bits_t REFO1CON1bits __at(0xEE1);
// bitfield macros
#define _REFO1CON1_ROSEL_POSN                               0x0
#define _REFO1CON1_ROSEL_POSITION                           0x0
#define _REFO1CON1_ROSEL_SIZE                               0x4
#define _REFO1CON1_ROSEL_LENGTH                             0x4
#define _REFO1CON1_ROSEL_MASK                               0xF
#define _REFO1CON1_ROSEL0_POSN                              0x0
#define _REFO1CON1_ROSEL0_POSITION                          0x0
#define _REFO1CON1_ROSEL0_SIZE                              0x1
#define _REFO1CON1_ROSEL0_LENGTH                            0x1
#define _REFO1CON1_ROSEL0_MASK                              0x1
#define _REFO1CON1_ROSEL1_POSN                              0x1
#define _REFO1CON1_ROSEL1_POSITION                          0x1
#define _REFO1CON1_ROSEL1_SIZE                              0x1
#define _REFO1CON1_ROSEL1_LENGTH                            0x1
#define _REFO1CON1_ROSEL1_MASK                              0x2
#define _REFO1CON1_ROSEL2_POSN                              0x2
#define _REFO1CON1_ROSEL2_POSITION                          0x2
#define _REFO1CON1_ROSEL2_SIZE                              0x1
#define _REFO1CON1_ROSEL2_LENGTH                            0x1
#define _REFO1CON1_ROSEL2_MASK                              0x4
#define _REFO1CON1_ROSEL3_POSN                              0x3
#define _REFO1CON1_ROSEL3_POSITION                          0x3
#define _REFO1CON1_ROSEL3_SIZE                              0x1
#define _REFO1CON1_ROSEL3_LENGTH                            0x1
#define _REFO1CON1_ROSEL3_MASK                              0x8

// Register: REFO1CON
#define REFO1CON REFO1CON
extern volatile unsigned char           REFO1CON            __at(0xEE2);
#ifndef _LIB_BUILD
asm("REFO1CON equ 0EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACTIVE                 :1;
        unsigned DIVSWEN                :1;
        unsigned                        :1;
        unsigned ROSSLP                 :1;
        unsigned ROOE                   :1;
        unsigned ROSIDL                 :1;
        unsigned                        :1;
        unsigned ROON                   :1;
    };
} REFO1CONbits_t;
extern volatile REFO1CONbits_t REFO1CONbits __at(0xEE2);
// bitfield macros
#define _REFO1CON_ACTIVE_POSN                               0x0
#define _REFO1CON_ACTIVE_POSITION                           0x0
#define _REFO1CON_ACTIVE_SIZE                               0x1
#define _REFO1CON_ACTIVE_LENGTH                             0x1
#define _REFO1CON_ACTIVE_MASK                               0x1
#define _REFO1CON_DIVSWEN_POSN                              0x1
#define _REFO1CON_DIVSWEN_POSITION                          0x1
#define _REFO1CON_DIVSWEN_SIZE                              0x1
#define _REFO1CON_DIVSWEN_LENGTH                            0x1
#define _REFO1CON_DIVSWEN_MASK                              0x2
#define _REFO1CON_ROSSLP_POSN                               0x3
#define _REFO1CON_ROSSLP_POSITION                           0x3
#define _REFO1CON_ROSSLP_SIZE                               0x1
#define _REFO1CON_ROSSLP_LENGTH                             0x1
#define _REFO1CON_ROSSLP_MASK                               0x8
#define _REFO1CON_ROOE_POSN                                 0x4
#define _REFO1CON_ROOE_POSITION                             0x4
#define _REFO1CON_ROOE_SIZE                                 0x1
#define _REFO1CON_ROOE_LENGTH                               0x1
#define _REFO1CON_ROOE_MASK                                 0x10
#define _REFO1CON_ROSIDL_POSN                               0x5
#define _REFO1CON_ROSIDL_POSITION                           0x5
#define _REFO1CON_ROSIDL_SIZE                               0x1
#define _REFO1CON_ROSIDL_LENGTH                             0x1
#define _REFO1CON_ROSIDL_MASK                               0x20
#define _REFO1CON_ROON_POSN                                 0x7
#define _REFO1CON_ROON_POSITION                             0x7
#define _REFO1CON_ROON_SIZE                                 0x1
#define _REFO1CON_ROON_LENGTH                               0x1
#define _REFO1CON_ROON_MASK                                 0x80

// Register: ODCON2
#define ODCON2 ODCON2
extern volatile unsigned char           ODCON2              __at(0xEEA);
#ifndef _LIB_BUILD
asm("ODCON2 equ 0EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP3OD                :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned CCP6OD                 :1;
        unsigned CCP7OD                 :1;
        unsigned CCP8OD                 :1;
        unsigned CCP9OD                 :1;
        unsigned CCP10OD                :1;
    };
} ODCON2bits_t;
extern volatile ODCON2bits_t ODCON2bits __at(0xEEA);
// bitfield macros
#define _ODCON2_ECCP3OD_POSN                                0x0
#define _ODCON2_ECCP3OD_POSITION                            0x0
#define _ODCON2_ECCP3OD_SIZE                                0x1
#define _ODCON2_ECCP3OD_LENGTH                              0x1
#define _ODCON2_ECCP3OD_MASK                                0x1
#define _ODCON2_CCP4OD_POSN                                 0x1
#define _ODCON2_CCP4OD_POSITION                             0x1
#define _ODCON2_CCP4OD_SIZE                                 0x1
#define _ODCON2_CCP4OD_LENGTH                               0x1
#define _ODCON2_CCP4OD_MASK                                 0x2
#define _ODCON2_CCP5OD_POSN                                 0x2
#define _ODCON2_CCP5OD_POSITION                             0x2
#define _ODCON2_CCP5OD_SIZE                                 0x1
#define _ODCON2_CCP5OD_LENGTH                               0x1
#define _ODCON2_CCP5OD_MASK                                 0x4
#define _ODCON2_CCP6OD_POSN                                 0x3
#define _ODCON2_CCP6OD_POSITION                             0x3
#define _ODCON2_CCP6OD_SIZE                                 0x1
#define _ODCON2_CCP6OD_LENGTH                               0x1
#define _ODCON2_CCP6OD_MASK                                 0x8
#define _ODCON2_CCP7OD_POSN                                 0x4
#define _ODCON2_CCP7OD_POSITION                             0x4
#define _ODCON2_CCP7OD_SIZE                                 0x1
#define _ODCON2_CCP7OD_LENGTH                               0x1
#define _ODCON2_CCP7OD_MASK                                 0x10
#define _ODCON2_CCP8OD_POSN                                 0x5
#define _ODCON2_CCP8OD_POSITION                             0x5
#define _ODCON2_CCP8OD_SIZE                                 0x1
#define _ODCON2_CCP8OD_LENGTH                               0x1
#define _ODCON2_CCP8OD_MASK                                 0x20
#define _ODCON2_CCP9OD_POSN                                 0x6
#define _ODCON2_CCP9OD_POSITION                             0x6
#define _ODCON2_CCP9OD_SIZE                                 0x1
#define _ODCON2_CCP9OD_LENGTH                               0x1
#define _ODCON2_CCP9OD_MASK                                 0x40
#define _ODCON2_CCP10OD_POSN                                0x7
#define _ODCON2_CCP10OD_POSITION                            0x7
#define _ODCON2_CCP10OD_SIZE                                0x1
#define _ODCON2_CCP10OD_LENGTH                              0x1
#define _ODCON2_CCP10OD_MASK                                0x80

// Register: ODCON1
#define ODCON1 ODCON1
extern volatile unsigned char           ODCON1              __at(0xEEB);
#ifndef _LIB_BUILD
asm("ODCON1 equ 0EEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1OD                 :1;
        unsigned SSP2OD                 :1;
        unsigned USART1OD               :1;
        unsigned USART2OD               :1;
        unsigned USART3OD               :1;
        unsigned USART4OD               :1;
        unsigned ECCP1OD                :1;
        unsigned ECCP2OD                :1;
    };
} ODCON1bits_t;
extern volatile ODCON1bits_t ODCON1bits __at(0xEEB);
// bitfield macros
#define _ODCON1_SSP1OD_POSN                                 0x0
#define _ODCON1_SSP1OD_POSITION                             0x0
#define _ODCON1_SSP1OD_SIZE                                 0x1
#define _ODCON1_SSP1OD_LENGTH                               0x1
#define _ODCON1_SSP1OD_MASK                                 0x1
#define _ODCON1_SSP2OD_POSN                                 0x1
#define _ODCON1_SSP2OD_POSITION                             0x1
#define _ODCON1_SSP2OD_SIZE                                 0x1
#define _ODCON1_SSP2OD_LENGTH                               0x1
#define _ODCON1_SSP2OD_MASK                                 0x2
#define _ODCON1_USART1OD_POSN                               0x2
#define _ODCON1_USART1OD_POSITION                           0x2
#define _ODCON1_USART1OD_SIZE                               0x1
#define _ODCON1_USART1OD_LENGTH                             0x1
#define _ODCON1_USART1OD_MASK                               0x4
#define _ODCON1_USART2OD_POSN                               0x3
#define _ODCON1_USART2OD_POSITION                           0x3
#define _ODCON1_USART2OD_SIZE                               0x1
#define _ODCON1_USART2OD_LENGTH                             0x1
#define _ODCON1_USART2OD_MASK                               0x8
#define _ODCON1_USART3OD_POSN                               0x4
#define _ODCON1_USART3OD_POSITION                           0x4
#define _ODCON1_USART3OD_SIZE                               0x1
#define _ODCON1_USART3OD_LENGTH                             0x1
#define _ODCON1_USART3OD_MASK                               0x10
#define _ODCON1_USART4OD_POSN                               0x5
#define _ODCON1_USART4OD_POSITION                           0x5
#define _ODCON1_USART4OD_SIZE                               0x1
#define _ODCON1_USART4OD_LENGTH                             0x1
#define _ODCON1_USART4OD_MASK                               0x20
#define _ODCON1_ECCP1OD_POSN                                0x6
#define _ODCON1_ECCP1OD_POSITION                            0x6
#define _ODCON1_ECCP1OD_SIZE                                0x1
#define _ODCON1_ECCP1OD_LENGTH                              0x1
#define _ODCON1_ECCP1OD_MASK                                0x40
#define _ODCON1_ECCP2OD_POSN                                0x7
#define _ODCON1_ECCP2OD_POSITION                            0x7
#define _ODCON1_ECCP2OD_SIZE                                0x1
#define _ODCON1_ECCP2OD_LENGTH                              0x1
#define _ODCON1_ECCP2OD_MASK                                0x80

// Register: MDCARL
#define MDCARL MDCARL
extern volatile unsigned char           MDCARL              __at(0xEEC);
#ifndef _LIB_BUILD
asm("MDCARL equ 0EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCL                   :4;
        unsigned                        :1;
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned MDCLODIS               :1;
    };
    struct {
        unsigned MDCL0                  :1;
        unsigned MDCL1                  :1;
        unsigned MDCL2                  :1;
        unsigned MDCL3                  :1;
    };
} MDCARLbits_t;
extern volatile MDCARLbits_t MDCARLbits __at(0xEEC);
// bitfield macros
#define _MDCARL_MDCL_POSN                                   0x0
#define _MDCARL_MDCL_POSITION                               0x0
#define _MDCARL_MDCL_SIZE                                   0x4
#define _MDCARL_MDCL_LENGTH                                 0x4
#define _MDCARL_MDCL_MASK                                   0xF
#define _MDCARL_MDCLSYNC_POSN                               0x5
#define _MDCARL_MDCLSYNC_POSITION                           0x5
#define _MDCARL_MDCLSYNC_SIZE                               0x1
#define _MDCARL_MDCLSYNC_LENGTH                             0x1
#define _MDCARL_MDCLSYNC_MASK                               0x20
#define _MDCARL_MDCLPOL_POSN                                0x6
#define _MDCARL_MDCLPOL_POSITION                            0x6
#define _MDCARL_MDCLPOL_SIZE                                0x1
#define _MDCARL_MDCLPOL_LENGTH                              0x1
#define _MDCARL_MDCLPOL_MASK                                0x40
#define _MDCARL_MDCLODIS_POSN                               0x7
#define _MDCARL_MDCLODIS_POSITION                           0x7
#define _MDCARL_MDCLODIS_SIZE                               0x1
#define _MDCARL_MDCLODIS_LENGTH                             0x1
#define _MDCARL_MDCLODIS_MASK                               0x80
#define _MDCARL_MDCL0_POSN                                  0x0
#define _MDCARL_MDCL0_POSITION                              0x0
#define _MDCARL_MDCL0_SIZE                                  0x1
#define _MDCARL_MDCL0_LENGTH                                0x1
#define _MDCARL_MDCL0_MASK                                  0x1
#define _MDCARL_MDCL1_POSN                                  0x1
#define _MDCARL_MDCL1_POSITION                              0x1
#define _MDCARL_MDCL1_SIZE                                  0x1
#define _MDCARL_MDCL1_LENGTH                                0x1
#define _MDCARL_MDCL1_MASK                                  0x2
#define _MDCARL_MDCL2_POSN                                  0x2
#define _MDCARL_MDCL2_POSITION                              0x2
#define _MDCARL_MDCL2_SIZE                                  0x1
#define _MDCARL_MDCL2_LENGTH                                0x1
#define _MDCARL_MDCL2_MASK                                  0x4
#define _MDCARL_MDCL3_POSN                                  0x3
#define _MDCARL_MDCL3_POSITION                              0x3
#define _MDCARL_MDCL3_SIZE                                  0x1
#define _MDCARL_MDCL3_LENGTH                                0x1
#define _MDCARL_MDCL3_MASK                                  0x8

// Register: MDCARH
#define MDCARH MDCARH
extern volatile unsigned char           MDCARH              __at(0xEED);
#ifndef _LIB_BUILD
asm("MDCARH equ 0EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCH                   :4;
        unsigned                        :1;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
        unsigned MDCHODIS               :1;
    };
    struct {
        unsigned MDCH0                  :1;
        unsigned MDCH1                  :1;
        unsigned MDCH2                  :1;
        unsigned MDCH3                  :1;
    };
} MDCARHbits_t;
