MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J94/mcu.h
extern volatile RXADDRHbits_t RXADDRHbits __at(0xF6D);
// bitfield macros
#define _RXADDRH_DMARCVPTRHB_POSN                           0x0
#define _RXADDRH_DMARCVPTRHB_POSITION                       0x0
#define _RXADDRH_DMARCVPTRHB_SIZE                           0x4
#define _RXADDRH_DMARCVPTRHB_LENGTH                         0x4
#define _RXADDRH_DMARCVPTRHB_MASK                           0xF
#define _RXADDRH_RXADDR8_POSN                               0x0
#define _RXADDRH_RXADDR8_POSITION                           0x0
#define _RXADDRH_RXADDR8_SIZE                               0x1
#define _RXADDRH_RXADDR8_LENGTH                             0x1
#define _RXADDRH_RXADDR8_MASK                               0x1
#define _RXADDRH_RXADDR9_POSN                               0x1
#define _RXADDRH_RXADDR9_POSITION                           0x1
#define _RXADDRH_RXADDR9_SIZE                               0x1
#define _RXADDRH_RXADDR9_LENGTH                             0x1
#define _RXADDRH_RXADDR9_MASK                               0x2
#define _RXADDRH_RXADDR10_POSN                              0x2
#define _RXADDRH_RXADDR10_POSITION                          0x2
#define _RXADDRH_RXADDR10_SIZE                              0x1
#define _RXADDRH_RXADDR10_LENGTH                            0x1
#define _RXADDRH_RXADDR10_MASK                              0x4
#define _RXADDRH_RXADDR11_POSN                              0x3
#define _RXADDRH_RXADDR11_POSITION                          0x3
#define _RXADDRH_RXADDR11_SIZE                              0x1
#define _RXADDRH_RXADDR11_LENGTH                            0x1
#define _RXADDRH_RXADDR11_MASK                              0x8

// Register: RXADDRL
#define RXADDRL RXADDRL
extern volatile unsigned char           RXADDRL             __at(0xF6E);
#ifndef _LIB_BUILD
asm("RXADDRL equ 0F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMARCVPTRLB            :8;
    };
    struct {
        unsigned RXADDR0                :1;
        unsigned RXADDR1                :1;
        unsigned RXADDR2                :1;
        unsigned RXADDR3                :1;
        unsigned RXADDR4                :1;
        unsigned RXADDR5                :1;
        unsigned RXADDR6                :1;
        unsigned RXADDR7                :1;
    };
} RXADDRLbits_t;
extern volatile RXADDRLbits_t RXADDRLbits __at(0xF6E);
// bitfield macros
#define _RXADDRL_DMARCVPTRLB_POSN                           0x0
#define _RXADDRL_DMARCVPTRLB_POSITION                       0x0
#define _RXADDRL_DMARCVPTRLB_SIZE                           0x8
#define _RXADDRL_DMARCVPTRLB_LENGTH                         0x8
#define _RXADDRL_DMARCVPTRLB_MASK                           0xFF
#define _RXADDRL_RXADDR0_POSN                               0x0
#define _RXADDRL_RXADDR0_POSITION                           0x0
#define _RXADDRL_RXADDR0_SIZE                               0x1
#define _RXADDRL_RXADDR0_LENGTH                             0x1
#define _RXADDRL_RXADDR0_MASK                               0x1
#define _RXADDRL_RXADDR1_POSN                               0x1
#define _RXADDRL_RXADDR1_POSITION                           0x1
#define _RXADDRL_RXADDR1_SIZE                               0x1
#define _RXADDRL_RXADDR1_LENGTH                             0x1
#define _RXADDRL_RXADDR1_MASK                               0x2
#define _RXADDRL_RXADDR2_POSN                               0x2
#define _RXADDRL_RXADDR2_POSITION                           0x2
#define _RXADDRL_RXADDR2_SIZE                               0x1
#define _RXADDRL_RXADDR2_LENGTH                             0x1
#define _RXADDRL_RXADDR2_MASK                               0x4
#define _RXADDRL_RXADDR3_POSN                               0x3
#define _RXADDRL_RXADDR3_POSITION                           0x3
#define _RXADDRL_RXADDR3_SIZE                               0x1
#define _RXADDRL_RXADDR3_LENGTH                             0x1
#define _RXADDRL_RXADDR3_MASK                               0x8
#define _RXADDRL_RXADDR4_POSN                               0x4
#define _RXADDRL_RXADDR4_POSITION                           0x4
#define _RXADDRL_RXADDR4_SIZE                               0x1
#define _RXADDRL_RXADDR4_LENGTH                             0x1
#define _RXADDRL_RXADDR4_MASK                               0x10
#define _RXADDRL_RXADDR5_POSN                               0x5
#define _RXADDRL_RXADDR5_POSITION                           0x5
#define _RXADDRL_RXADDR5_SIZE                               0x1
#define _RXADDRL_RXADDR5_LENGTH                             0x1
#define _RXADDRL_RXADDR5_MASK                               0x20
#define _RXADDRL_RXADDR6_POSN                               0x6
#define _RXADDRL_RXADDR6_POSITION                           0x6
#define _RXADDRL_RXADDR6_SIZE                               0x1
#define _RXADDRL_RXADDR6_LENGTH                             0x1
#define _RXADDRL_RXADDR6_MASK                               0x40
#define _RXADDRL_RXADDR7_POSN                               0x7
#define _RXADDRL_RXADDR7_POSITION                           0x7
#define _RXADDRL_RXADDR7_SIZE                               0x1
#define _RXADDRL_RXADDR7_LENGTH                             0x1
#define _RXADDRL_RXADDR7_MASK                               0x80

// Register: TXADDRH
#define TXADDRH TXADDRH
extern volatile unsigned char           TXADDRH             __at(0xF6F);
#ifndef _LIB_BUILD
asm("TXADDRH equ 0F6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMATXPTRHB             :4;
    };
    struct {
        unsigned TXADDR8                :1;
        unsigned TXADDR9                :1;
        unsigned TXADDR10               :1;
        unsigned TXADDR11               :1;
    };
} TXADDRHbits_t;
extern volatile TXADDRHbits_t TXADDRHbits __at(0xF6F);
// bitfield macros
#define _TXADDRH_DMATXPTRHB_POSN                            0x0
#define _TXADDRH_DMATXPTRHB_POSITION                        0x0
#define _TXADDRH_DMATXPTRHB_SIZE                            0x4
#define _TXADDRH_DMATXPTRHB_LENGTH                          0x4
#define _TXADDRH_DMATXPTRHB_MASK                            0xF
#define _TXADDRH_TXADDR8_POSN                               0x0
#define _TXADDRH_TXADDR8_POSITION                           0x0
#define _TXADDRH_TXADDR8_SIZE                               0x1
#define _TXADDRH_TXADDR8_LENGTH                             0x1
#define _TXADDRH_TXADDR8_MASK                               0x1
#define _TXADDRH_TXADDR9_POSN                               0x1
#define _TXADDRH_TXADDR9_POSITION                           0x1
#define _TXADDRH_TXADDR9_SIZE                               0x1
#define _TXADDRH_TXADDR9_LENGTH                             0x1
#define _TXADDRH_TXADDR9_MASK                               0x2
#define _TXADDRH_TXADDR10_POSN                              0x2
#define _TXADDRH_TXADDR10_POSITION                          0x2
#define _TXADDRH_TXADDR10_SIZE                              0x1
#define _TXADDRH_TXADDR10_LENGTH                            0x1
#define _TXADDRH_TXADDR10_MASK                              0x4
#define _TXADDRH_TXADDR11_POSN                              0x3
#define _TXADDRH_TXADDR11_POSITION                          0x3
#define _TXADDRH_TXADDR11_SIZE                              0x1
#define _TXADDRH_TXADDR11_LENGTH                            0x1
#define _TXADDRH_TXADDR11_MASK                              0x8

// Register: TXADDRL
#define TXADDRL TXADDRL
extern volatile unsigned char           TXADDRL             __at(0xF70);
#ifndef _LIB_BUILD
asm("TXADDRL equ 0F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMATXPTRLB             :8;
    };
    struct {
        unsigned TXADDR0                :1;
        unsigned TXADDR1                :1;
        unsigned TXADDR2                :1;
        unsigned TXADDR3                :1;
        unsigned TXADDR4                :1;
        unsigned TXADDR5                :1;
        unsigned TXADDR6                :1;
        unsigned TXADDR7                :1;
    };
} TXADDRLbits_t;
extern volatile TXADDRLbits_t TXADDRLbits __at(0xF70);
// bitfield macros
#define _TXADDRL_DMATXPTRLB_POSN                            0x0
#define _TXADDRL_DMATXPTRLB_POSITION                        0x0
#define _TXADDRL_DMATXPTRLB_SIZE                            0x8
#define _TXADDRL_DMATXPTRLB_LENGTH                          0x8
#define _TXADDRL_DMATXPTRLB_MASK                            0xFF
#define _TXADDRL_TXADDR0_POSN                               0x0
#define _TXADDRL_TXADDR0_POSITION                           0x0
#define _TXADDRL_TXADDR0_SIZE                               0x1
#define _TXADDRL_TXADDR0_LENGTH                             0x1
#define _TXADDRL_TXADDR0_MASK                               0x1
#define _TXADDRL_TXADDR1_POSN                               0x1
#define _TXADDRL_TXADDR1_POSITION                           0x1
#define _TXADDRL_TXADDR1_SIZE                               0x1
#define _TXADDRL_TXADDR1_LENGTH                             0x1
#define _TXADDRL_TXADDR1_MASK                               0x2
#define _TXADDRL_TXADDR2_POSN                               0x2
#define _TXADDRL_TXADDR2_POSITION                           0x2
#define _TXADDRL_TXADDR2_SIZE                               0x1
#define _TXADDRL_TXADDR2_LENGTH                             0x1
#define _TXADDRL_TXADDR2_MASK                               0x4
#define _TXADDRL_TXADDR3_POSN                               0x3
#define _TXADDRL_TXADDR3_POSITION                           0x3
#define _TXADDRL_TXADDR3_SIZE                               0x1
#define _TXADDRL_TXADDR3_LENGTH                             0x1
#define _TXADDRL_TXADDR3_MASK                               0x8
#define _TXADDRL_TXADDR4_POSN                               0x4
#define _TXADDRL_TXADDR4_POSITION                           0x4
#define _TXADDRL_TXADDR4_SIZE                               0x1
#define _TXADDRL_TXADDR4_LENGTH                             0x1
#define _TXADDRL_TXADDR4_MASK                               0x10
#define _TXADDRL_TXADDR5_POSN                               0x5
#define _TXADDRL_TXADDR5_POSITION                           0x5
#define _TXADDRL_TXADDR5_SIZE                               0x1
#define _TXADDRL_TXADDR5_LENGTH                             0x1
#define _TXADDRL_TXADDR5_MASK                               0x20
#define _TXADDRL_TXADDR6_POSN                               0x6
#define _TXADDRL_TXADDR6_POSITION                           0x6
#define _TXADDRL_TXADDR6_SIZE                               0x1
#define _TXADDRL_TXADDR6_LENGTH                             0x1
#define _TXADDRL_TXADDR6_MASK                               0x40
#define _TXADDRL_TXADDR7_POSN                               0x7
#define _TXADDRL_TXADDR7_POSITION                           0x7
#define _TXADDRL_TXADDR7_SIZE                               0x1
#define _TXADDRL_TXADDR7_LENGTH                             0x1
#define _TXADDRL_TXADDR7_MASK                               0x80

