MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J94/mcu.h
#define                                 PBIO0R3_bit         _BIT_ACCESS(RPINR46_47,3)
// RPINR46_47<PBIO1R0>
extern volatile __bit                   PBIO1R0             __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 PBIO1R0_bit         _BIT_ACCESS(RPINR46_47,4)
// RPINR46_47<PBIO1R1>
extern volatile __bit                   PBIO1R1             __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 PBIO1R1_bit         _BIT_ACCESS(RPINR46_47,5)
// RPINR46_47<PBIO1R2>
extern volatile __bit                   PBIO1R2             __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 PBIO1R2_bit         _BIT_ACCESS(RPINR46_47,6)
// RPINR46_47<PBIO1R3>
extern volatile __bit                   PBIO1R3             __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 PBIO1R3_bit         _BIT_ACCESS(RPINR46_47,7)
// RPINR48_49<PBIO2R0>
extern volatile __bit                   PBIO2R0             __at(0x7210);	// @ (0xE42 * 8 + 0)
#define                                 PBIO2R0_bit         _BIT_ACCESS(RPINR48_49,0)
// RPINR48_49<PBIO2R1>
extern volatile __bit                   PBIO2R1             __at(0x7211);	// @ (0xE42 * 8 + 1)
#define                                 PBIO2R1_bit         _BIT_ACCESS(RPINR48_49,1)
// RPINR48_49<PBIO2R2>
extern volatile __bit                   PBIO2R2             __at(0x7212);	// @ (0xE42 * 8 + 2)
#define                                 PBIO2R2_bit         _BIT_ACCESS(RPINR48_49,2)
// RPINR48_49<PBIO2R3>
extern volatile __bit                   PBIO2R3             __at(0x7213);	// @ (0xE42 * 8 + 3)
#define                                 PBIO2R3_bit         _BIT_ACCESS(RPINR48_49,3)
// RPINR48_49<PBIO3R0>
extern volatile __bit                   PBIO3R0             __at(0x7214);	// @ (0xE42 * 8 + 4)
#define                                 PBIO3R0_bit         _BIT_ACCESS(RPINR48_49,4)
// RPINR48_49<PBIO3R1>
extern volatile __bit                   PBIO3R1             __at(0x7215);	// @ (0xE42 * 8 + 5)
#define                                 PBIO3R1_bit         _BIT_ACCESS(RPINR48_49,5)
// RPINR48_49<PBIO3R2>
extern volatile __bit                   PBIO3R2             __at(0x7216);	// @ (0xE42 * 8 + 6)
#define                                 PBIO3R2_bit         _BIT_ACCESS(RPINR48_49,6)
// RPINR48_49<PBIO3R3>
extern volatile __bit                   PBIO3R3             __at(0x7217);	// @ (0xE42 * 8 + 7)
#define                                 PBIO3R3_bit         _BIT_ACCESS(RPINR48_49,7)
// RPINR50_51<PBIO4R0>
extern volatile __bit                   PBIO4R0             __at(0x7218);	// @ (0xE43 * 8 + 0)
#define                                 PBIO4R0_bit         _BIT_ACCESS(RPINR50_51,0)
// RPINR50_51<PBIO4R1>
extern volatile __bit                   PBIO4R1             __at(0x7219);	// @ (0xE43 * 8 + 1)
#define                                 PBIO4R1_bit         _BIT_ACCESS(RPINR50_51,1)
// RPINR50_51<PBIO4R2>
extern volatile __bit                   PBIO4R2             __at(0x721A);	// @ (0xE43 * 8 + 2)
#define                                 PBIO4R2_bit         _BIT_ACCESS(RPINR50_51,2)
// RPINR50_51<PBIO4R3>
extern volatile __bit                   PBIO4R3             __at(0x721B);	// @ (0xE43 * 8 + 3)
#define                                 PBIO4R3_bit         _BIT_ACCESS(RPINR50_51,3)
// RPINR50_51<PBIO5R0>
extern volatile __bit                   PBIO5R0             __at(0x721C);	// @ (0xE43 * 8 + 4)
#define                                 PBIO5R0_bit         _BIT_ACCESS(RPINR50_51,4)
// RPINR50_51<PBIO5R1>
extern volatile __bit                   PBIO5R1             __at(0x721D);	// @ (0xE43 * 8 + 5)
#define                                 PBIO5R1_bit         _BIT_ACCESS(RPINR50_51,5)
// RPINR50_51<PBIO5R2>
extern volatile __bit                   PBIO5R2             __at(0x721E);	// @ (0xE43 * 8 + 6)
#define                                 PBIO5R2_bit         _BIT_ACCESS(RPINR50_51,6)
// RPINR50_51<PBIO5R3>
extern volatile __bit                   PBIO5R3             __at(0x721F);	// @ (0xE43 * 8 + 7)
#define                                 PBIO5R3_bit         _BIT_ACCESS(RPINR50_51,7)
// RPINR52_53<PBIO6R0>
extern volatile __bit                   PBIO6R0             __at(0x7220);	// @ (0xE44 * 8 + 0)
#define                                 PBIO6R0_bit         _BIT_ACCESS(RPINR52_53,0)
// RPINR52_53<PBIO6R1>
extern volatile __bit                   PBIO6R1             __at(0x7221);	// @ (0xE44 * 8 + 1)
#define                                 PBIO6R1_bit         _BIT_ACCESS(RPINR52_53,1)
// RPINR52_53<PBIO6R2>
extern volatile __bit                   PBIO6R2             __at(0x7222);	// @ (0xE44 * 8 + 2)
#define                                 PBIO6R2_bit         _BIT_ACCESS(RPINR52_53,2)
// RPINR52_53<PBIO6R3>
extern volatile __bit                   PBIO6R3             __at(0x7223);	// @ (0xE44 * 8 + 3)
#define                                 PBIO6R3_bit         _BIT_ACCESS(RPINR52_53,3)
// RPINR52_53<PBIO7R0>
extern volatile __bit                   PBIO7R0             __at(0x7224);	// @ (0xE44 * 8 + 4)
#define                                 PBIO7R0_bit         _BIT_ACCESS(RPINR52_53,4)
// RPINR52_53<PBIO7R1>
extern volatile __bit                   PBIO7R1             __at(0x7225);	// @ (0xE44 * 8 + 5)
#define                                 PBIO7R1_bit         _BIT_ACCESS(RPINR52_53,5)
// RPINR52_53<PBIO7R2>
extern volatile __bit                   PBIO7R2             __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 PBIO7R2_bit         _BIT_ACCESS(RPINR52_53,6)
// RPINR52_53<PBIO7R3>
extern volatile __bit                   PBIO7R3             __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 PBIO7R3_bit         _BIT_ACCESS(RPINR52_53,7)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   _PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)  // Note: Changed by MikroE
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG13>
extern volatile __bit                   PCFG13              __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON2<PCFG16>
extern volatile __bit                   PCFG16              __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 PCFG16_bit          _BIT_ACCESS(ANCON2,0)
// ANCON2<PCFG17>
extern volatile __bit                   PCFG17              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 PCFG17_bit          _BIT_ACCESS(ANCON2,1)
// ANCON2<PCFG18>
extern volatile __bit                   PCFG18              __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 PCFG18_bit          _BIT_ACCESS(ANCON2,2)
// ANCON2<PCFG19>
extern volatile __bit                   PCFG19              __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 PCFG19_bit          _BIT_ACCESS(ANCON2,3)
// ANCON2<PCFG20>
extern volatile __bit                   PCFG20              __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 PCFG20_bit          _BIT_ACCESS(ANCON2,4)
// ANCON2<PCFG21>
extern volatile __bit                   PCFG21              __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 PCFG21_bit          _BIT_ACCESS(ANCON2,5)
// ANCON2<PCFG22>
extern volatile __bit                   PCFG22              __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 PCFG22_bit          _BIT_ACCESS(ANCON2,6)
// ANCON2<PCFG23>
extern volatile __bit                   PCFG23              __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 PCFG23_bit          _BIT_ACCESS(ANCON2,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7239);	// @ (0xE47 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   _PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)  // Note: Changed by MikroE
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// UEIE<PIDEE>
extern volatile __bit                   PIDEE               __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PIDEE_bit           _BIT_ACCESS(UEIE,0)
// UEIR<PIDEF>
extern volatile __bit                   PIDEF               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 PIDEF_bit           _BIT_ACCESS(UEIR,0)
// UCON<PKTDIS>
extern volatile __bit                   PKTDIS              __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 PKTDIS_bit          _BIT_ACCESS(UCON,4)
// OSCCON4<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCCON4,5)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// RCON4<PMSLP>
extern volatile __bit                   PMSLP               __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 PMSLP_bit           _BIT_ACCESS(RCON4,0)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// OSCCON2<POSCEN>
extern volatile __bit                   POSCEN              __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 POSCEN_bit          _BIT_ACCESS(OSCCON2,2)
// UCFG<PPB0>
extern volatile __bit                   PPB0                __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 PPB0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<PPB1>
extern volatile __bit                   PPB1                __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 PPB1_bit            _BIT_ACCESS(UCFG,1)
// USTAT<PPBI>
extern volatile __bit                   PPBI                __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 PPBI_bit            _BIT_ACCESS(USTAT,1)
// UCON<PPBRST>
extern volatile __bit                   PPBRST              __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 PPBRST_bit          _BIT_ACCESS(UCON,6)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PMD3<PSPMD>
extern volatile __bit                   PSPMD               __at(0x778A);	// @ (0xEF1 * 8 + 2)
#define                                 PSPMD_bit           _BIT_ACCESS(PMD3,2)
// PSPCON<PSPMODE>
extern volatile __bit                   PSPMODE             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 PSPMODE_bit         _BIT_ACCESS(PSPCON,4)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7A92);	// @ (0xF52 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7A93);	// @ (0xF52 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// ADCON3H<PUMPEN>
extern volatile __bit                   PUMPEN              __at(0x745D);	// @ (0xE8B * 8 + 5)
#define                                 PUMPEN_bit          _BIT_ACCESS(ADCON3H,5)
// ADCON2H<PVCFG0>
extern volatile __bit                   PVCFG0              __at(0x746E);	// @ (0xE8D * 8 + 6)
#define                                 PVCFG0_bit          _BIT_ACCESS(ADCON2H,6)
// ADCON2H<PVCFG1>
extern volatile __bit                   PVCFG1              __at(0x746F);	// @ (0xE8D * 8 + 7)
#define                                 PVCFG1_bit          _BIT_ACCESS(ADCON2H,7)
// RTCCON2<PWCCPRE>
extern volatile __bit                   PWCCPRE             __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 PWCCPRE_bit         _BIT_ACCESS(RTCCON2,5)
// RTCCON2<PWCEN>
extern volatile __bit                   PWCEN               __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 PWCEN_bit           _BIT_ACCESS(RTCCON2,7)
// RTCCON2<PWCPOL>
extern volatile __bit                   PWCPOL              __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 PWCPOL_bit          _BIT_ACCESS(RTCCON2,6)
// RTCCON2<PWCSPRE>
extern volatile __bit                   PWCSPRE             __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 PWCSPRE_bit         _BIT_ACCESS(RTCCON2,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<RC2IP>
extern volatile __bit                   RC2IP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 RC2IP_bit           _BIT_ACCESS(IPR3,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PIE6<RC3IE>
extern volatile __bit                   RC3IE               __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 RC3IE_bit           _BIT_ACCESS(PIE6,5)
// PIR6<RC3IF>
extern volatile __bit                   RC3IF               __at(0x7D35);	// @ (0xFA6 * 8 + 5)
#define                                 RC3IF_bit           _BIT_ACCESS(PIR6,5)
// IPR6<RC3IP>
extern volatile __bit                   RC3IP               __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 RC3IP_bit           _BIT_ACCESS(IPR6,5)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PIE6<RC4IE>
extern volatile __bit                   RC4IE               __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 RC4IE_bit           _BIT_ACCESS(PIE6,7)
